{
  "Job Title": "Technical Designer",
  "Company": "Aritzia",
  "Location": "Vancouver, BC",
  "Employment Type": "Full-time",
  "Level": "Mid-Senior",
  "Industry": "Retail",
  "Skills": [
    "Design",
    "Adobe Illustrator"
  ],
  "Job Description": "THE TEAM\nThe mission of the Technical Design Department is to translate conceptual designs into actionable blue prints that meet customer demand.\nTHE OPPORTUNITY\nAs a member of the Technical Design Department you will be part of the team responsible for delivering the clothes our clients will love – and race out to buy. As the Designer, Technical Design, you will translate the Creative Design vision in order to develop the components and specifications of each garment. And, with the skills you gain in this role, the opportunities are endless – from a rewarding career in Product to continued growth and development with Aritzia.\nTHE ROLE As the Technical Designer, you will support to:\nIdentify external marketplace trends across all applicable product elements\nDevelop all necessary details of style and components of each colour\nEnsure all detailed specifications are expertly captured for each individual style/colour on the tech pack\nQUALIFICATIONS The Technical Designer has:\nA commitment to learn and apply Aritzia's Business and People Leadership principles\nAn ability to take on new opportunities and challenges, with a passion to continue to develop and grow oneself\nA dedication to operational efficiency, investing in process and systems to improve team and business results\nThe intellectual and emotional intelligence to tactically partner cross-functionally in the pursuit of shared business outcomes\nThe skills to set clear objectives and hold oneself accountable to reach your full capability and maximize your capacity\nThe skills and/or education that are an asset to perform in the role and the appetite to continuously learn and develop oneself\nA commitment to quality and investing in results that add value and drive the business\nA sense of urgency executing job responsibilities, prioritizing urgent and important work\nAn ability to identify, evaluate, and suggest business opportunities for today and tomorrow, considering top line and bottom line impacts\nTHE PERKS Some of the industry-leading benefits you will receive working at Aritzia:\nA-OK Commissary & Café - Our in-office, world-class bistro and café\nThe SET - Our in-house gym, with state-of-the art equipment and custom classes\nAspirational Workspace - Every detail is considered to connect to the energy of the culture\nDog Friendly Office - Bring your best friend to work\nAmenities - Facilities include private parent's room, bike storage rooms, and shower facilities with complimentary conveniences\nProduct Discount - Our famous product discount, online and in store\nExtras - A multitude of other perks like dry-cleaning, hotel and restaurant discounts, self-care promos, on-site medical care and more\nHealth & Safety - Industry-leading health and safety precautions, including on-site screenings, mask and distancing protocols, and cleaning supplies",

    "Job Title": "Senior Product Designer (Teams)",
   "Company": "Microsoft",
   "Location": "Vancouver, BC Remote",
   "Job Description": "We're looking for a well-rounded Senior Product Designer to join us in defining and designing compelling experiences that empower people to achieve more together. You will shape the direction of the core communication and collaboration experiences for Microsoft Teams, the chat-based collaboration app that is changing how people work together. Our design team is a highly collaborative group of user researchers, engineers, and product designers. We value creativity, open idea sharing, and having fun while we work. Most of all, we’re motivated by our millions of users, and we want them to love our products. In this role, you'll help to conceptualize the big picture as well as drive detailed design development for collaboration and communications user experiences. You should have a proven record of innovative thinking, a history of using design to drive new ideas, and the ability to help others to make the right design decisions. You'll work directly with other design teams inside of Microsoft to drive shared experiences inside and outside of the Teams app, as well as improve the general craftsmanship of the product in a tactical way across mobile and desktop. Join us! Microsoft Design on Instagram Teams Design on YouTube Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form. Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
   "Employment Type": "Full-time",
   "Experience Level": "Mid-Senior level",
   "Number of Employees": "10,001+",
   "Industry": "Software Development",
   "Connections": "6",
   "Company Alumni": "1",
   "School Alumni": "110",
   "Applicants": "7",
   "Skills Matched": "7 of 10",
   "Benefits": "Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
   "Equal Opportunity Employer": true
}

